RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
#include "ble_gap_struct_serialization.h"
#include "ble_serialization.h"
#include "cond_field_serialization.h"
#include "app_util.h"
#include "string.h"
#include "ble_gatts.h"

uint32_t ble_gap_evt_adv_report_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_adv_report_t);

    uint8_t ser_data = (p_struct->scan_rsp & 0x01)
                       | ((p_struct->type & 0x03) << 1);
    uint8_t data_len = (p_struct->dlen & 0x1F);
    SER_PUSH_FIELD(&p_struct->peer_addr, ble_gap_addr_t_enc);
    SER_PUSH_FIELD(&p_struct->direct_addr, ble_gap_addr_t_enc);
    SER_PUSH_int8(&p_struct->rssi);
    SER_PUSH_uint8(&ser_data);
    SER_PUSH_len8data(p_struct->data, data_len);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_adv_report_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_adv_report_t);

    uint8_t ser_data;
    uint8_t data_len = BLE_GAP_ADV_MAX_SIZE;
    uint8_t * p_field_data = p_struct->data;
    SER_PULL_FIELD(&p_struct->peer_addr, ble_gap_addr_t_dec);
    SER_PULL_FIELD(&p_struct->direct_addr, ble_gap_addr_t_dec);
    SER_PULL_int8(&p_struct->rssi);
    SER_PULL_uint8(&ser_data);
    SER_PULL_len8data(&p_field_data, &data_len);

    p_struct->scan_rsp = ser_data & 0x01;
    p_struct->type     = (ser_data >> 1) & 0x03;
    p_struct->dlen     = data_len;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_irk_t_enc(void const * const p_void_struct,
                           uint8_t * const    p_buf,
                           uint32_t           buf_len,
                           uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_irk_t);
    SER_PUSH_uint8array(p_struct->irk, BLE_GAP_SEC_KEY_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_irk_t_dec(uint8_t const * const p_buf,
                           uint32_t              buf_len,
                           uint32_t * const      p_index,
                           void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_irk_t);
    SER_PULL_uint8array(p_struct->irk, BLE_GAP_SEC_KEY_LEN);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_addr_t_enc(void const * const p_void_struct,
                            uint8_t * const    p_buf,
                            uint32_t           buf_len,
                            uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_addr_t);

    uint8_t ser_data = (p_struct->addr_id_peer & 0x01)
                       | ((p_struct->addr_type & 0x7F) << 1);
    SER_PUSH_uint8(&ser_data);
    SER_PUSH_uint8array(p_struct->addr, BLE_GAP_ADDR_LEN);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_addr_t_dec(uint8_t const * const p_buf,
                            uint32_t              buf_len,
                            uint32_t * const      p_index,
                            void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_addr_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    SER_PULL_uint8array(p_struct->addr, BLE_GAP_ADDR_LEN);

    p_struct->addr_id_peer = ser_data & 0x01;
    p_struct->addr_type    = (ser_data >> 1) & 0x7F;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_sec_levels_t_enc(void const * const p_void_struct,
                                  uint8_t * const    p_buf,
                                  uint32_t           buf_len,
                                  uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sec_levels_t);

    uint8_t sec_levels_serialized = (p_struct->lv1 << 0) | (p_struct->lv2 << 1)
                                    | (p_struct->lv3 << 2) | (p_struct->lv4 << 3);
    SER_PUSH_uint8(&sec_levels_serialized);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sec_levels_t_dec(uint8_t const * const p_buf,
                                  uint32_t              buf_len,
                                  uint32_t * const      p_index,
                                  void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sec_levels_t);

    uint32_t sec_levels_serialized;
    SER_PULL_uint8(&sec_levels_serialized);

    p_struct->lv1 = sec_levels_serialized & 0x01;
    p_struct->lv2 = (sec_levels_serialized >> 1) & 0x01;
    p_struct->lv3 = (sec_levels_serialized >> 2) & 0x01;
    p_struct->lv4 = (sec_levels_serialized >> 3) & 0x01;

    SER_STRUCT_DEC_END;
}

