RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
uint32_t ble_gap_sec_keys_t_enc(void const * const p_void_struct,
                                uint8_t * const    p_buf,
                                uint32_t           buf_len,
                                uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sec_keys_t);

    SER_PUSH_COND(p_struct->p_enc_key, ble_gap_enc_key_t_enc);
    SER_PUSH_COND(p_struct->p_id_key, ble_gap_id_key_t_enc);
    SER_PUSH_COND(p_struct->p_sign_key, ble_gap_sign_info_t_enc);
    SER_PUSH_COND(p_struct->p_pk, ble_gap_lesc_p256_pk_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sec_keys_t_dec(uint8_t const * const p_buf,
                                uint32_t              buf_len,
                                uint32_t * const      p_index,
                                void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sec_keys_t);

    SER_PULL_COND(&(p_struct->p_enc_key), ble_gap_enc_key_t_dec);
    SER_PULL_COND(&(p_struct->p_id_key), ble_gap_id_key_t_dec);
    SER_PULL_COND(&(p_struct->p_sign_key), ble_gap_sign_info_t_dec);
    SER_PULL_COND(&(p_struct->p_pk), ble_gap_lesc_p256_pk_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_enc_info_t_enc(void const * const p_void_struct,
                                uint8_t * const    p_buf,
                                uint32_t           buf_len,
                                uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_enc_info_t);

    SER_PUSH_uint8array(p_struct->ltk, BLE_GAP_SEC_KEY_LEN);
    uint8_t ser_data = (p_struct->lesc & 0x01)
                       | ((p_struct->auth & 0x01) << 1)
                       | ((p_struct->ltk_len & 0x3F) << 2);
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_enc_info_t_dec(uint8_t const * const p_buf,
                                uint32_t              buf_len,
                                uint32_t * const      p_index,
                                void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_enc_info_t);

    uint8_t ser_data;
    SER_PULL_uint8array(p_struct->ltk, BLE_GAP_SEC_KEY_LEN);
    SER_PULL_uint8(&ser_data);
    p_struct->lesc    = ser_data & 0x01;
    p_struct->auth    = (ser_data >> 1) & 0x01;
    p_struct->ltk_len = (ser_data >> 2) & 0x3F;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_sign_info_t_enc(void const * const p_void_struct,
                                 uint8_t * const    p_buf,
                                 uint32_t           buf_len,
                                 uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sign_info_t);
    SER_PUSH_uint8array(p_struct->csrk, BLE_GAP_SEC_KEY_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sign_info_t_dec(uint8_t const * const p_buf,
                                 uint32_t              buf_len,
                                 uint32_t * const      p_index,
                                 void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sign_info_t);
    SER_PULL_uint8array(p_struct->csrk, BLE_GAP_SEC_KEY_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_auth_status_t_enc(void const * const p_void_struct,
                                       uint8_t * const    p_buf,
                                       uint32_t           buf_len,
                                       uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_auth_status_t);

    uint8_t ser_data = (p_struct->error_src) | ((p_struct->bonded) << 2);
    SER_PUSH_uint8(&(p_struct->auth_status));
    SER_PUSH_uint8(&ser_data);

    SER_PUSH_FIELD(&(p_struct->sm1_levels), ble_gap_sec_levels_t_enc);
    SER_PUSH_FIELD(&(p_struct->sm2_levels), ble_gap_sec_levels_t_enc);
    SER_PUSH_FIELD(&(p_struct->kdist_own), ble_gap_sec_kdist_t_enc);
    SER_PUSH_FIELD(&(p_struct->kdist_peer), ble_gap_sec_kdist_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_auth_status_t_dec(uint8_t const * const p_buf,
                                       uint32_t              buf_len,
                                       uint32_t * const      p_index,
                                       void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_auth_status_t);

    uint8_t ser_data;
    SER_PULL_uint8(&(p_struct->auth_status));
    SER_PULL_uint8(&ser_data);
    p_struct->error_src = ser_data & 0x03;
    p_struct->bonded    = (ser_data >> 2) & 0x01;

    SER_PULL_FIELD(&(p_struct->sm1_levels), ble_gap_sec_levels_t_dec);
    SER_PULL_FIELD(&(p_struct->sm2_levels), ble_gap_sec_levels_t_dec);
    SER_PULL_FIELD(&(p_struct->kdist_own), ble_gap_sec_kdist_t_dec);
    SER_PULL_FIELD(&(p_struct->kdist_peer), ble_gap_sec_kdist_t_dec);

    SER_STRUCT_DEC_END;
}


uint32_t ble_gap_conn_sec_mode_t_enc(void const * const p_void_struct,
                                     uint8_t * const    p_buf,
                                     uint32_t           buf_len,
                                     uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_conn_sec_mode_t);

    uint8_t ser_data = (p_struct->sm & 0x0F)
                       | ((p_struct->lv & 0x0F) << 4);
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_conn_sec_mode_t_dec(uint8_t const * const p_buf,
                                     uint32_t              buf_len,
                                     uint32_t * const      p_index,
                                     void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_conn_sec_mode_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->sm = ser_data & 0x0F;
    p_struct->lv = (ser_data >> 4) & 0x0F;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_conn_sec_update_t_enc(void const * const p_void_struct,
                                           uint8_t * const    p_buf,
                                           uint32_t           buf_len,
                                           uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_conn_sec_update_t);
    SER_PUSH_FIELD(&(p_struct->conn_sec), ble_gap_conn_sec_t_enc);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_conn_sec_update_t_dec(uint8_t const * const p_buf,
                                           uint32_t              buf_len,
                                           uint32_t * const      p_index,
                                           void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_conn_sec_update_t);
    SER_PULL_FIELD(&(p_struct->conn_sec), ble_gap_conn_sec_t_dec);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_conn_sec_t_enc(void const * const p_void_struct,
                                uint8_t * const    p_buf,
                                uint32_t           buf_len,
                                uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_conn_sec_t);

