RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
    SER_PUSH_FIELD(&p_struct->sec_mode, ble_gap_conn_sec_mode_t_enc);
    SER_PUSH_uint8(&p_struct->encr_key_size);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_conn_sec_t_dec(uint8_t const * const p_buf,
                                uint32_t              buf_len,
                                uint32_t * const      p_index,
                                void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_conn_sec_t);

    SER_PULL_FIELD(&p_struct->sec_mode, ble_gap_conn_sec_mode_t_dec);
    SER_PULL_uint8(&p_struct->encr_key_size);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_sec_info_request_t_enc(void const * const p_void_struct,
                                            uint8_t * const    p_buf,
                                            uint32_t           buf_len,
                                            uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_sec_info_request_t);

    uint8_t ser_data = (p_struct->enc_info & 0x01)
                       | ((p_struct->id_info & 0x01) << 1)
                       | ((p_struct->sign_info& 0x01) << 2);
    SER_PUSH_FIELD(&p_struct->peer_addr, ble_gap_addr_t_enc);
    SER_PUSH_FIELD(&p_struct->master_id, ble_gap_master_id_t_enc);
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_sec_info_request_t_dec(uint8_t const * const p_buf,
                                            uint32_t              buf_len,
                                            uint32_t * const      p_index,
                                            void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_sec_info_request_t);

    uint8_t ser_data;
    SER_PULL_FIELD(&p_struct->peer_addr, ble_gap_addr_t_dec);
    SER_PULL_FIELD(&p_struct->master_id, ble_gap_master_id_t_dec);
    SER_PULL_uint8(&ser_data);
    p_struct->enc_info  = ser_data & 0x01;
    p_struct->id_info   = (ser_data >> 1) & 0x01;
    p_struct->sign_info = (ser_data >> 2) & 0x01;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_connected_t_enc(void const * const p_void_struct,
                                     uint8_t * const    p_buf,
                                     uint32_t           buf_len,
                                     uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_connected_t);

    SER_PUSH_FIELD(&p_struct->peer_addr, ble_gap_addr_t_enc);
    SER_PUSH_uint8(&p_struct->role);
    SER_PUSH_FIELD(&p_struct->conn_params, ble_gap_conn_params_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_connected_t_dec(uint8_t const * const p_buf,
                                     uint32_t              buf_len,
                                     uint32_t * const      p_index,
                                     void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_connected_t);

    SER_PULL_FIELD(&p_struct->peer_addr, ble_gap_addr_t_dec);
    SER_PULL_uint8(&p_struct->role);
    SER_PULL_FIELD(&p_struct->conn_params, ble_gap_conn_params_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_sec_params_t_enc(void const * const p_void_struct,
                                  uint8_t * const    p_buf,
                                  uint32_t           buf_len,
                                  uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sec_params_t);

    uint8_t ser_data = (p_struct->bond      & 0x01)
                       | ((p_struct->mitm     & 0x01) << 1)
                       | ((p_struct->lesc     & 0x01) << 2)
                       | ((p_struct->keypress & 0x01) << 3)
                       | ((p_struct->io_caps  & 0x07) << 4)
                       | ((p_struct->oob      & 0x01) << 7);
    SER_PUSH_uint8(&ser_data);
    SER_PUSH_uint8(&p_struct->min_key_size);
    SER_PUSH_uint8(&p_struct->max_key_size);
    SER_PUSH_FIELD(&p_struct->kdist_own, ble_gap_sec_kdist_t_enc);
    SER_PUSH_FIELD(&p_struct->kdist_peer, ble_gap_sec_kdist_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sec_params_t_dec(uint8_t const * const p_buf,
                                  uint32_t              buf_len,
                                  uint32_t * const      p_index,
                                  void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sec_params_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    SER_PULL_uint8(&p_struct->min_key_size);
    SER_PULL_uint8(&p_struct->max_key_size);
    SER_PULL_FIELD(&p_struct->kdist_own, ble_gap_sec_kdist_t_dec);
    SER_PULL_FIELD(&p_struct->kdist_peer, ble_gap_sec_kdist_t_dec);
    p_struct->bond     = ser_data & 0x01;
    p_struct->mitm     = (ser_data >> 1) & 0x01;
    p_struct->lesc     = (ser_data >> 2) & 0x01;
    p_struct->keypress = (ser_data >> 3) & 0x01;
    p_struct->io_caps  = (ser_data >> 4) & 0x07;
    p_struct->oob      = (ser_data >> 7) & 0x01;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_sec_params_request_t_enc(void const * const p_void_struct,
                                              uint8_t * const    p_buf,
                                              uint32_t           buf_len,
                                              uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_sec_params_request_t);
    SER_PUSH_FIELD(&(p_struct->peer_params), ble_gap_sec_params_t_enc);
    SER_STRUCT_ENC_END;
}

 uint32_t ble_gap_evt_sec_params_request_t_dec(uint8_t const * const p_buf,
                                               uint32_t              buf_len,
                                               uint32_t * const      p_index,
                                               void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_sec_params_request_t);
    SER_PULL_FIELD(&(p_struct->peer_params), ble_gap_sec_params_t_dec);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_conn_param_update_t_enc(void const * const p_void_struct,
                                             uint8_t * const    p_buf,
                                             uint32_t           buf_len,
                                             uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_conn_param_update_t);
    SER_PUSH_FIELD(&(p_struct->conn_params), ble_gap_conn_params_t_enc);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_conn_param_update_t_dec(uint8_t const * const p_buf,
                                             uint32_t              buf_len,
                                             uint32_t * const      p_index,
                                             void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_conn_param_update_t);
    SER_PULL_FIELD(&(p_struct->conn_params), ble_gap_conn_params_t_dec);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_conn_param_update_request_t_enc(void const * const p_void_struct,
                                                     uint8_t * const    p_buf,
                                                     uint32_t           buf_len,
                                                     uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_conn_param_update_request_t);
    SER_PUSH_FIELD(&(p_struct->conn_params), ble_gap_conn_params_t_enc);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_conn_param_update_request_t_dec(uint8_t const * const p_buf,
                                             uint32_t              buf_len,
                                             uint32_t * const      p_index,
                                             void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_conn_param_update_request_t);
    SER_PULL_FIELD(&(p_struct->conn_params), ble_gap_conn_params_t_dec);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_conn_params_t_enc(void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_conn_params_t);

    SER_PUSH_uint16(&p_struct->min_conn_interval);
    SER_PUSH_uint16(&p_struct->max_conn_interval);
    SER_PUSH_uint16(&p_struct->slave_latency);
    SER_PUSH_uint16(&p_struct->conn_sup_timeout);

    SER_STRUCT_ENC_END;
}

