RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
uint32_t ble_gap_conn_params_t_dec(uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_conn_params_t);

    SER_PULL_uint16(&p_struct->min_conn_interval);
    SER_PULL_uint16(&p_struct->max_conn_interval);
    SER_PULL_uint16(&p_struct->slave_latency);
    SER_PULL_uint16(&p_struct->conn_sup_timeout);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_disconnected_t_enc(void const * const p_void_struct,
                                        uint8_t * const    p_buf,
                                        uint32_t           buf_len,
                                        uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_disconnected_t);
    SER_PUSH_uint8(&p_struct->reason);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_disconnected_t_dec(uint8_t const * const p_buf,
                                        uint32_t              buf_len,
                                        uint32_t * const      p_index,
                                        void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_disconnected_t);
    SER_PULL_uint8(&p_struct->reason);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_master_id_t_enc(void const * const p_void_struct,
                                 uint8_t * const    p_buf,
                                 uint32_t           buf_len,
                                 uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_master_id_t);
    SER_PUSH_uint16(&p_struct->ediv);
    SER_PUSH_uint8array(p_struct->rand, BLE_GAP_SEC_RAND_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_master_id_t_dec(uint8_t const * const p_buf,
                                 uint32_t              buf_len,
                                 uint32_t * const      p_index,
                                 void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_master_id_t);
    SER_PULL_uint16(&p_struct->ediv);
    SER_PULL_uint8array(p_struct->rand, BLE_GAP_SEC_RAND_LEN);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_scan_params_t_enc(void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_scan_params_t);

    uint8_t ser_data = (p_struct->active & 0x01)
                       | ((p_struct->use_whitelist & 0x01) << 1)
                       | ((p_struct->adv_dir_report & 0x01) << 2);
    SER_PUSH_uint8(&ser_data);
    SER_PUSH_uint16(&p_struct->interval);
    SER_PUSH_uint16(&p_struct->window);
    SER_PUSH_uint16(&p_struct->timeout);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_scan_params_t_dec(uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_scan_params_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    SER_PULL_uint16(&p_struct->interval);
    SER_PULL_uint16(&p_struct->window);
    SER_PULL_uint16(&p_struct->timeout);

    p_struct->active         = ser_data & 0x01;
    p_struct->use_whitelist  = (ser_data >> 1) & 0x01;
    p_struct->adv_dir_report = (ser_data >> 2) & 0x01;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_enc_key_t_enc(void const * const p_void_struct,
                               uint8_t * const    p_buf,
                               uint32_t           buf_len,
                               uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_enc_key_t);

    SER_PUSH_FIELD(&p_struct->enc_info, ble_gap_enc_info_t_enc);
    SER_PUSH_FIELD(&p_struct->master_id, ble_gap_master_id_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_enc_key_t_dec(uint8_t const * const p_buf,
                               uint32_t              buf_len,
                               uint32_t * const      p_index,
                               void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_enc_key_t);

    SER_PULL_FIELD(&p_struct->enc_info, ble_gap_enc_info_t_dec);
    SER_PULL_FIELD(&p_struct->master_id, ble_gap_master_id_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_id_key_t_enc(void const * const p_void_struct,
                              uint8_t * const    p_buf,
                              uint32_t           buf_len,
                              uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_id_key_t);

    SER_PUSH_FIELD(&p_struct->id_info, ble_gap_irk_t_enc);
    SER_PUSH_FIELD(&p_struct->id_addr_info, ble_gap_addr_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_id_key_t_dec(uint8_t const * const p_buf,
                              uint32_t              buf_len,
                              uint32_t * const      p_index,
                              void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_id_key_t);

    SER_PULL_FIELD(&p_struct->id_info, ble_gap_irk_t_dec);
    SER_PULL_FIELD(&p_struct->id_addr_info, ble_gap_addr_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_sec_keyset_t_enc(void const * const p_void_struct,
                                  uint8_t * const    p_buf,
                                  uint32_t           buf_len,
                                  uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sec_keyset_t);

    SER_PUSH_FIELD(&p_struct->keys_own, ble_gap_sec_keys_t_enc);
    SER_PUSH_FIELD(&p_struct->keys_peer, ble_gap_sec_keys_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sec_keyset_t_dec(uint8_t const * const p_buf,
                                  uint32_t              buf_len,
                                  uint32_t * const      p_index,
                                  void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sec_keyset_t);

    SER_PULL_FIELD(&p_struct->keys_own, ble_gap_sec_keys_t_dec);
    SER_PULL_FIELD(&p_struct->keys_peer, ble_gap_sec_keys_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_evt_sec_request_t_enc(void const * const p_void_struct,
                                       uint8_t * const    p_buf,
                                       uint32_t           buf_len,
                                       uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_evt_sec_request_t);

    uint8_t ser_data = (p_struct->bond & 0x01)
                       | ((p_struct->mitm & 0x01) << 1)
                       | ((p_struct->lesc & 0x01) << 2)
                       | ((p_struct->keypress & 0x01) << 3);
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_evt_sec_request_t_dec(uint8_t const * const p_buf,
                                       uint32_t              buf_len,
                                       uint32_t * const      p_index,
                                       void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_evt_sec_request_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->bond = ser_data & 0x01;
    p_struct->mitm = (ser_data >> 1) & 0x01;
    p_struct->lesc = (ser_data >> 2) & 0x01;
    p_struct->keypress = (ser_data >> 3) & 0x01;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_sec_kdist_t_enc(void const * const p_void_struct,
                                 uint8_t * const    p_buf,
                                 uint32_t           buf_len,
                                 uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_sec_kdist_t);

    uint8_t ser_data =   (p_struct->enc  & 0x01)
                       | (p_struct->id   & 0x01) << 1
                       | (p_struct->sign & 0x01) << 2
                       | (p_struct->link & 0x01) << 3;
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_sec_kdist_t_dec(uint8_t const * const p_buf,
                                 uint32_t              buf_len,
                                 uint32_t * const      p_index,
                                 void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_sec_kdist_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->enc   = ser_data & 0x01;
    p_struct->id    = (ser_data >> 1) & 0x01;
    p_struct->sign  = (ser_data >> 2) & 0x01;
    p_struct->link  = (ser_data >> 3) & 0x01;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_ch_map_t_enc(void const * const p_void_struct,
                                  uint8_t * const    p_buf,
                                  uint32_t           buf_len,
                                  uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_ch_map_t);

    SER_PUSH_uint16(&p_struct->conn_handle);
    SER_PUSH_uint8array(p_struct->ch_map, 5);

    SER_STRUCT_ENC_END;
}

