RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
uint32_t ble_gap_opt_ch_map_t_dec(uint8_t const * const p_buf,
                                  uint32_t              buf_len,
                                  uint32_t * const      p_index,
                                  void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_ch_map_t);

    SER_PULL_uint16(&p_struct->conn_handle);
    SER_PULL_uint8array(p_struct->ch_map, 5);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_local_conn_latency_t_enc(void const * const p_void_struct,
                                              uint8_t * const    p_buf,
                                              uint32_t           buf_len,
                                              uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_local_conn_latency_t);

    SER_PUSH_uint16(&p_struct->conn_handle);
    SER_PUSH_uint16(&p_struct->requested_latency);
    SER_PUSH_COND(p_struct->p_actual_latency, uint16_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_local_conn_latency_t_dec(uint8_t const * const p_buf,
                                              uint32_t              buf_len,
                                              uint32_t * const      p_index,
                                              void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_local_conn_latency_t);

    SER_PULL_uint16(&p_struct->conn_handle);
    SER_PULL_uint16(&p_struct->requested_latency);
    SER_PULL_COND(&p_struct->p_actual_latency, uint16_t_dec);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_passkey_t_enc(void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_passkey_t);
    SER_PUSH_buf(p_struct->p_passkey, BLE_GAP_PASSKEY_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_passkey_t_dec(uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_passkey_t);
    SER_PULL_buf((uint8_t**)&p_struct->p_passkey, BLE_GAP_PASSKEY_LEN, BLE_GAP_PASSKEY_LEN);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_scan_req_report_t_enc(void const * const p_void_struct,
                                           uint8_t * const    p_buf,
                                           uint32_t           buf_len,
                                           uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_scan_req_report_t);

    uint8_t ser_data = p_struct->enable & 0x01;
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_scan_req_report_t_dec(uint8_t const * const p_buf,
                                           uint32_t              buf_len,
                                           uint32_t * const      p_index,
                                           void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_scan_req_report_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->enable = ser_data & 0x01;

    SER_STRUCT_DEC_END;
}

#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
uint32_t ble_gap_opt_compat_mode_t_enc(void const * const p_void_struct,
                                       uint8_t * const    p_buf,
                                       uint32_t           buf_len,
                                       uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_compat_mode_t);

    uint8_t ser_data = p_struct->mode_1_enable & 0x01;
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_compat_mode_t_dec(uint8_t const * const p_buf,
                                       uint32_t              buf_len,
                                       uint32_t * const      p_index,
                                       void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_compat_mode_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->mode_1_enable = ser_data & 0x01;

    SER_STRUCT_DEC_END;
}
#endif

uint32_t ble_gap_adv_ch_mask_t_enc(void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_adv_ch_mask_t);

    uint8_t ser_data = (p_struct->ch_37_off & 0x01)
                       | ((p_struct->ch_38_off & 0x01) << 1)
                       | ((p_struct->ch_39_off & 0x01) << 2);
    SER_PUSH_uint8(&ser_data);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_adv_ch_mask_t_dec(uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_adv_ch_mask_t);

    uint8_t ser_data;
    SER_PULL_uint8(&ser_data);
    p_struct->ch_37_off = ser_data & 0x01;
    p_struct->ch_38_off = (ser_data >> 1) & 0x01;
    p_struct->ch_39_off = (ser_data >> 2) & 0x01;

    SER_STRUCT_DEC_END;
}

#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
uint32_t ble_gap_enable_params_t_enc(void const * const p_void_struct,
                                     uint8_t * const    p_buf,
                                     uint32_t           buf_len,
                                     uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_enable_params_t);

    SER_PUSH_uint8(&p_struct->periph_conn_count);
    SER_PUSH_uint8(&p_struct->central_conn_count);
    SER_PUSH_uint8(&p_struct->central_sec_count);
    SER_PUSH_COND(p_struct->p_device_name, ble_gap_device_name_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_enable_params_t_dec(uint8_t const * const p_buf,
                                     uint32_t              buf_len,
                                     uint32_t * const      p_index,
                                     void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_enable_params_t);

    SER_PULL_uint8(&p_struct->periph_conn_count);
    SER_PULL_uint8(&p_struct->central_conn_count);
    SER_PULL_uint8(&p_struct->central_sec_count);
    SER_PULL_COND(&p_struct->p_device_name, ble_gap_device_name_t_dec);

    SER_STRUCT_DEC_END;
}
#endif

uint32_t ble_gap_lesc_p256_pk_t_enc(void const * const p_void_struct,
                               uint8_t * const    p_buf,
                               uint32_t           buf_len,
                               uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_lesc_p256_pk_t);
    SER_PUSH_uint8array(p_struct->pk, BLE_GAP_LESC_P256_PK_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_lesc_p256_pk_t_dec(uint8_t const * const p_buf,
                               uint32_t              buf_len,
                               uint32_t * const      p_index,
                               void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_lesc_p256_pk_t);
    SER_PULL_uint8array(p_struct->pk, BLE_GAP_LESC_P256_PK_LEN);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_lesc_dhkey_t_enc(void const * const p_void_struct,
                               uint8_t * const    p_buf,
                               uint32_t           buf_len,
                               uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_lesc_dhkey_t);
    SER_PUSH_uint8array(p_struct->key, BLE_GAP_LESC_DHKEY_LEN);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_lesc_dhkey_t_dec(uint8_t const * const p_buf,
                               uint32_t              buf_len,
                               uint32_t * const      p_index,
                               void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_lesc_dhkey_t);
    SER_PULL_uint8array(p_struct->key, BLE_GAP_LESC_DHKEY_LEN);
    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_lesc_oob_data_t_enc(void const * const p_void_struct,
                                 uint8_t * const    p_buf,
                                 uint32_t           buf_len,
                                 uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_lesc_oob_data_t);

