RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
    SER_PUSH_FIELD(&p_struct->addr, ble_gap_addr_t_enc);
    SER_PUSH_uint8array(p_struct->r, BLE_GAP_SEC_KEY_LEN);
    SER_PUSH_uint8array(p_struct->c, BLE_GAP_SEC_KEY_LEN);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_lesc_oob_data_t_dec(uint8_t const * const p_buf,
                                 uint32_t              buf_len,
                                 uint32_t * const      p_index,
                                 void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_lesc_oob_data_t);

    SER_PULL_FIELD(&p_struct->addr, ble_gap_addr_t_dec);
    SER_PULL_uint8array(p_struct->r, BLE_GAP_SEC_KEY_LEN);
    SER_PULL_uint8array(p_struct->c, BLE_GAP_SEC_KEY_LEN);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_adv_params_t_enc(void const * const p_void_struct,
                                 uint8_t * const    p_buf,
                                 uint32_t           buf_len,
                                 uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_adv_params_t);

    SER_PUSH_uint8(&p_struct->type);
    SER_PUSH_COND(p_struct->p_peer_addr, ble_gap_addr_t_enc);
    SER_PUSH_uint8(&p_struct->fp);
    SER_PUSH_uint16(&p_struct->interval);
    SER_PUSH_uint16(&p_struct->timeout);
    SER_PUSH_FIELD(&p_struct->channel_mask, ble_gap_adv_ch_mask_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_adv_params_t_dec(uint8_t const * const p_buf,
                                 uint32_t              buf_len,
                                 uint32_t * const      p_index,
                                 void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_adv_params_t);

    SER_PULL_uint8(&p_struct->type);
    SER_PULL_COND(&p_struct->p_peer_addr, ble_gap_addr_t_dec);
    SER_PULL_uint8(&p_struct->fp);
    SER_PULL_uint16(&p_struct->interval);
    SER_PULL_uint16(&p_struct->timeout);
    SER_PULL_FIELD(&p_struct->channel_mask, ble_gap_adv_ch_mask_t_dec);

    SER_STRUCT_DEC_END;
}
#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
uint32_t ble_gap_opt_ext_len_t_enc(void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_ext_len_t);
    SER_PUSH_uint8(&p_struct->rxtx_max_pdu_payload_size);
    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_ext_len_t_dec(uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_ext_len_t);
    SER_PULL_uint8(&p_struct->rxtx_max_pdu_payload_size);
    SER_STRUCT_DEC_END;
}
#endif
uint32_t ble_gap_opt_auth_payload_timeout_t_enc(void const * const p_void_struct,
                                                uint8_t * const    p_buf,
                                                uint32_t           buf_len,
                                                uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_auth_payload_timeout_t);

    SER_PUSH_uint16(&p_struct->conn_handle);
    SER_PUSH_uint16(&p_struct->auth_payload_timeout);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_auth_payload_timeout_t_dec(uint8_t const * const p_buf,
                                                uint32_t              buf_len,
                                                uint32_t * const      p_index,
                                                void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_auth_payload_timeout_t);

    SER_PULL_uint16(&p_struct->conn_handle);
    SER_PULL_uint16(&p_struct->auth_payload_timeout);

    SER_STRUCT_DEC_END;
}

#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
uint32_t ble_gap_device_name_t_enc
#else
uint32_t ble_gap_cfg_device_name_t_enc
#endif
                                  (void const * const p_void_struct,
                                   uint8_t * const    p_buf,
                                   uint32_t           buf_len,
                                   uint32_t * const   p_index)

{
#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
    SER_STRUCT_ENC_BEGIN(ble_gap_device_name_t);
#else
    SER_STRUCT_ENC_BEGIN(ble_gap_cfg_device_name_t);
#endif
    /* serializer does not support attributes on stack */
    if (p_struct->vloc != BLE_GATTS_VLOC_STACK)
    {
        err_code = NRF_ERROR_INVALID_PARAM;
    }

    SER_PUSH_FIELD(&p_struct->write_perm, ble_gap_conn_sec_mode_t_enc);

    uint8_t ser_data = p_struct->vloc & 0x03;
    SER_PUSH_uint8(&ser_data);
    SER_PUSH_uint16(&p_struct->current_len);
    SER_PUSH_uint16(&p_struct->max_len);
    SER_PUSH_buf(p_struct->p_value, p_struct->current_len);

    SER_STRUCT_ENC_END;
}

#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
uint32_t ble_gap_device_name_t_dec
#else
uint32_t ble_gap_cfg_device_name_t_dec
#endif
                                  (uint8_t const * const p_buf,
                                   uint32_t              buf_len,
                                   uint32_t * const      p_index,
                                   void * const          p_void_struct)
{
#if defined(NRF_SD_BLE_API_VERSION) && NRF_SD_BLE_API_VERSION < 4
    SER_STRUCT_DEC_BEGIN(ble_gap_device_name_t);
#else
    SER_STRUCT_DEC_BEGIN(ble_gap_cfg_device_name_t);
#endif

    uint16_t value_max_len = p_struct->max_len;
    uint8_t  ser_data;
    SER_PULL_FIELD(&p_struct->write_perm, ble_gap_conn_sec_mode_t_dec);
    SER_PULL_uint8(&ser_data);
    p_struct->vloc = ser_data & 0x03;
    SER_PULL_uint16(&p_struct->current_len);
    SER_PULL_uint16(&p_struct->max_len);
    SER_PULL_buf(&p_struct->p_value,value_max_len, p_struct->current_len);

    SER_STRUCT_DEC_END;
}



uint32_t ble_gap_privacy_params_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_privacy_params_t);

    SER_PUSH_uint8(&p_struct->privacy_mode);
    SER_PUSH_uint8(&p_struct->private_addr_type);
    SER_PUSH_uint16(&p_struct->private_addr_cycle_s);
    SER_PUSH_COND(p_struct->p_device_irk, ble_gap_irk_t_enc);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_privacy_params_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_privacy_params_t);

    SER_PULL_uint8(&p_struct->privacy_mode);
    SER_PULL_uint8(&p_struct->private_addr_type);
    SER_PULL_uint16(&p_struct->private_addr_cycle_s);
    SER_PULL_COND(&p_struct->p_device_irk, ble_gap_irk_t_dec);

    SER_STRUCT_DEC_END;
}




#if NRF_SD_BLE_API_VERSION >= 4
uint32_t ble_gap_opt_compat_mode_1_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_compat_mode_1_t);

