RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/serialization/common/struct_ser/ble/ble_gap_struct_serialization.c
    uint8_t enable = p_struct->enable;
    SER_PUSH_uint8(&enable);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_compat_mode_1_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_compat_mode_1_t);

    uint8_t enable;
    SER_PULL_uint8(&enable);
    p_struct->enable = enable;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_compat_mode_2_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_compat_mode_2_t);

    uint8_t enable = p_struct->enable;
    SER_PUSH_uint8(&enable);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_compat_mode_2_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_compat_mode_2_t);

    uint8_t enable;
    SER_PULL_uint8(&enable);
    p_struct->enable = enable;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_opt_slave_latency_disable_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_opt_slave_latency_disable_t);

    SER_PUSH_uint16(&p_struct->conn_handle);
    uint8_t disable = p_struct->disable;
    SER_PUSH_uint8(&disable);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_opt_slave_latency_disable_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_opt_slave_latency_disable_t);

    SER_PULL_uint16(&p_struct->conn_handle);
    uint8_t disable;
    SER_PULL_uint8(&disable);
    p_struct->disable = disable;

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_conn_cfg_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_conn_cfg_t);

    SER_PUSH_uint8(&p_struct->conn_count);
    SER_PUSH_uint16(&p_struct->event_length);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_conn_cfg_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_conn_cfg_t);

    SER_PULL_uint8(&p_struct->conn_count);
    SER_PULL_uint16(&p_struct->event_length);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_cfg_role_count_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_cfg_role_count_t);

    SER_PUSH_uint8(&p_struct->periph_role_count);
    SER_PUSH_uint8(&p_struct->central_role_count);
    SER_PUSH_uint8(&p_struct->central_sec_count);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_cfg_role_count_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_cfg_role_count_t);

    SER_PULL_uint8(&p_struct->periph_role_count);
    SER_PULL_uint8(&p_struct->central_role_count);
    SER_PULL_uint8(&p_struct->central_sec_count);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_data_length_params_t_enc(void const * const p_void_struct,
                                      uint8_t * const    p_buf,
                                      uint32_t           buf_len,
                                      uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_data_length_params_t);

    SER_PUSH_uint8(&p_struct->max_tx_octets);
    SER_PUSH_uint8(&p_struct->max_rx_octets);
    SER_PUSH_uint16(&p_struct->max_tx_time_us);
    SER_PUSH_uint16(&p_struct->max_rx_time_us);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_data_length_params_t_dec(uint8_t const * const p_buf,
                                      uint32_t              buf_len,
                                      uint32_t * const      p_index,
                                      void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_data_length_params_t);

    SER_PULL_uint8(&p_struct->max_tx_octets);
    SER_PULL_uint8(&p_struct->max_rx_octets);
    SER_PULL_uint16(&p_struct->max_tx_time_us);
    SER_PULL_uint16(&p_struct->max_rx_time_us);

    SER_STRUCT_DEC_END;
}

uint32_t ble_gap_data_length_limitation_t_enc(void const * const p_void_struct,
                                              uint8_t * const    p_buf,
                                              uint32_t           buf_len,
                                              uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_data_length_limitation_t);

    SER_PUSH_uint8(&p_struct->tx_payload_limited_octets);
    SER_PUSH_uint8(&p_struct->rx_payload_limited_octets);
    SER_PUSH_uint16(&p_struct->tx_rx_time_limited_us);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_data_length_limitation_t_dec(uint8_t const * const p_buf,
                                              uint32_t              buf_len,
                                              uint32_t * const      p_index,
                                              void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_data_length_limitation_t);

    SER_PULL_uint8(&p_struct->tx_payload_limited_octets);
    SER_PULL_uint8(&p_struct->rx_payload_limited_octets);
    SER_PULL_uint16(&p_struct->tx_rx_time_limited_us);

    SER_STRUCT_DEC_END;
}
#endif

#if NRF_SD_BLE_API_VERSION >= 5
uint32_t ble_gap_phys_t_enc(void const * const p_void_struct,
                            uint8_t * const    p_buf,
                            uint32_t           buf_len,
                            uint32_t * const   p_index)
{
    SER_STRUCT_ENC_BEGIN(ble_gap_phys_t);

    SER_PUSH_uint8(&p_struct->tx_phys);
    SER_PUSH_uint8(&p_struct->rx_phys);

    SER_STRUCT_ENC_END;
}

uint32_t ble_gap_phys_t_dec(uint8_t const * const p_buf,
                            uint32_t              buf_len,
                            uint32_t * const      p_index,
                            void * const          p_void_struct)
{
    SER_STRUCT_DEC_BEGIN(ble_gap_phys_t);

    SER_PULL_uint8(&p_struct->tx_phys);
    SER_PULL_uint8(&p_struct->rx_phys);

    SER_STRUCT_DEC_END;
}
#endif
